# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..Dispose Method
LightType Class See Also
---
Releases all resources used by the LightType
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace